In [3]:
import numpy as np
import pandas as pd

In [ ]:
data = pd.read_csv('./employees.csv')

In [6]:
type(data)
salary = data['Salary']

In [8]:
salaryArr = data['Salary'].values

In [15]:
data.head(n=2)
data.tail(n=2)
data.sample(n=3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
568,Susan,Female,4/18/1986,9:31 AM,90829,19.142,False,Marketing
586,Rose,Female,10/30/2004,4:34 PM,56961,7.585,False,Marketing
154,Rebecca,Female,11/15/1980,4:13 AM,85730,5.359,True,Product

In [18]:
data.columns
data.columns = ['First Name', 'Gender', 'Start Date', 'Last Login', 'Salary', 'Bonus %', 'Senior Management', 'Team'] # change column name
data.rename(columns={'Bonus %': 'Bonus', 'Last Login': 'Last login time'}) # rename selected

,First Name,Gender,Start Date,Last login time,Salary,Bonus,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [20]:
data['Gender'].value_counts()   # dosent count null data
data['Team'].value_counts()

Client Services         106
Finance                 102
Business Development    101
Marketing                98
Product                  95
Sales                    94
Engineering              92
Human Resources          91
Distribution             90
Legal                    88
Name: Team, dtype: int64

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login         1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [22]:
data.describe()

              Salary      Bonus %
count    1000.000000  1000.000000
mean    90662.181000    10.207555
std     32923.693342     5.528481
min     35013.000000     1.015000
25%     62613.000000     5.401750
50%     90428.000000     9.838500
75%    118740.250000    14.838000
max    149908.000000    19.944000

In [26]:
data['Senior Management'] = data['Senior Management'].astype(dtype=bool)
data['Start Date'] = pd.to_datetime(data['Start Date'])
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login         1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), datetime64[ns](1), float64(1), int64(1), object(4)
memory usage: 55.8+ KB

In [27]:
data.isnull().sum()

First Name            67
Gender               145
Start Date             0
Last Login             0
Salary                 0
Bonus %                0
Senior Management      0
Team                  43
dtype: int64

In [28]:
# drop the row where all column is null
data1 = data.dropna(how='all')
len(data1)

1000

In [29]:
# drop a row having any column null
data1 = data.dropna(how='any')
len(data1)

764

In [30]:
data1.isnull().sum()

First Name           0
Gender               0
Start Date           0
Last Login           0
Salary               0
Bonus %              0
Senior Management    0
Team                 0
dtype: int64

In [32]:
data['First Name'] = data['First Name'].fillna('Unknown')
data['Gender'] = data['Gender'].fillna('Other')
data['Team'] = data['Team'].fillna('Unknown')
data.isnull().sum()

First Name           0
Gender               0
Start Date           0
Last Login           0
Salary               0
Bonus %              0
Senior Management    0
Team                 0
dtype: int64

In [36]:
data2 = data.groupby(by = "Gender")[["Salary", "Bonus %"]].apply(sum)
data2

            Salary   Bonus %
Gender
Female  38800311.0  4306.127
Male    38660604.0  4392.570
Other   13201266.0  1508.858

In [39]:
data.iloc[2:5, :]

,First Name,Gender,Start Date,Last Login,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,4:47 PM,101004,1.389,True,Client Services

In [42]:
data.loc[2:5,:][["First Name", "Gender", "Salary"]]

  First Name  Gender  Salary
2      Maria  Female  130590
3      Jerry    Male  138705
4      Larry    Male  101004
5     Dennis    Male  115163

Index(['First Name', 'Gender', 'Start Date', 'Last Login', 'Salary', 'Bonus %',
       'Senior Management', 'Team'],
      dtype='object')

In [44]:
data3 = data.sort_values(by="Salary", ascending=False)

In [45]:
data3.to_csv("./sortedSal.csv")